<?php
return [
    'headlines' => [
        'line1' => 'أقوى دروس اونلاين',
        'line2' => 'أفضل منصه تعليميه اونلاين',
        'line3' => "ابحث عن الدروس، ذاكر وامتحن اونلاين، من بيتك مع افضل المدرسين، هتكون دايما فى القمه",
        'line4' => "اتعلم اونلاين من بيتك",
        'line5' => "المذاكرة بقت أسهل، قرب من حلمك، كل اللى محتاج تعمله انك تسجل وطريقك للنجاح مضمون",
        'line6' => 'اتعلم مع اففضل المدرسين وتميز فى دروسك',
        'line7' => 'متاح، مرن، اى وقت، فى أى مكان، لكل الناس',
        'line8' => 'اختبر نفسك واتحسن فى كل مره',
        'line9' => 'اشترى واقرأ كتب اونلاين للمدرس على المنصة',
        'line10' => 'كل اللى محتاج نعمله انك تسجل، احنا بنقدم أفضل تجربة للتعلم لكل الناس. تقدر تختار انك تذاكر أى وقت وفى أى مكان وتمتحن اونلاين.',
    ],
    'add_new_course' => 'إضافة كورس جديد',
    'edit' => 'تعديل',
    'delete' => 'حذف',
    'read_more' => 'اقرأ المزيد',
    'join_now' => 'انضم الان',
    'skilled_instructors' => 'مدرسين محترفين',
    'online_classes' => 'دروس اونلاين',
    'home_exams' => 'امتحانات منزليه',
    'book_library' => 'مكتبه اونلاين',
    'welcome_to' => config('app.name') . ' أهلا بيك فى منصة',
    'welcome_message' => 'منصه تعليميه اونلاين هدفنا ناخد بإيدك عشان تحط رجلك على طريق النجاح',
    'detailed_reports' => 'تقارير مفصلة',
    'unique_experience' => 'تجربة فريدة',
    'categories' => 'الفئات',
    'courses_categories' => 'فئات المواد',
    'courses' => 'المواد',
    'popular_courses' => 'المناهج الرائجه',
    'hrs' => 'ساعه',
    'lessons' => 'الدروس',
    'instructors' => 'المدرسين',
    'instructor_name' => 'اسم المدرس',
    'expert_instructors' => 'مدرسين محترفين',
    'testimonial' => 'توصيات',
    'testimonial_description' => 'رأى طلابنا',
    'course_syllabus' => 'منهج',
    'about_us' => 'عن المنصة',
    'home' => 'الرئيسية',
    'about' => 'عن المنصة',
    'contact' => 'تواصل معنا',
    'pages' => 'الصفحات',
    'hi' => 'مرحبا',
    'hello' => 'مرحبا',
    'our_team' => 'فريقنا',
    'privacy_policy' => 'سياسه الخصوصية',
    'terms_conditions' => 'الشروط والأحكام',
    'faq' => 'الأسئلة الشائعة',
    'quick_link' => 'روابط',
    'gallery' => 'معرض الصور',
    'newsletter' => 'نشرة الأخبار',
    'newsletter_description' => 'انضم للنشرة الإخباريه ليصلك احدث العروض والأخبار.',
    'rights_reserved' => 'جميع الحقوق محفوظه.',
    'signup' => 'سجل',
    'your_email' => 'بريدك الإلكترونى',
    'not_found' => 'غير موجود',
    'page_not_found' => 'الصفحه غير موجوده',
    '404' => '404',
    '404_description' => 'نعتذر، الصفحه التى تبحث عنها غير موجودة على موقعنا! ربما تود الذهاب الى الصفحه الرئيسية او تستخدم أداة البحث',
    'back_home' => 'العودة للرئيسية',
    'privacy' => [
        'effective_date' => 'تاريخ السريان : ' . config('app.privacy_policy_date'),
        'intro' => 'تشرح سياسة الخصوصية كيف تقوم ' . config('app.name') . ' ("نحن" أو "لنا") بجمع المعلومات عنك واستخدامها وإفشائها عند استخدامك لمنصة التعلم عبر الإنترنت وأي خدمات أو مواقع ويب أو تطبيقات متنقلة ذات صلة (ويشار إليها مجتمعةً باسم "الخدمات")',
        'line1' => ' <strong> 1- المعلومات التي نجمعها</strong><br>
            1.1. المعلومات الشخصية: قد نقوم بجمع المعلومات الشخصية التي تقدمها لنا، مثل اسمك وعنوان بريدك الإلكتروني وكلمة المرور ومعلومات الدفع وأي معلومات أخرى تختار تقديمها.
            <br>
            1.2. معلومات الاستخدام: قد نجمع معلومات عن كيفية استخدامك للخدمات، بما في ذلك تفاعلاتك مع المنصة وبيانات التسجيل والتقدم والإنجاز في المقررات.
            <br>
            1.3. معلومات الجهاز: قد نجمع معلومات عن الجهاز الذي تستخدمه للوصول إلى الخدمات، مثل عنوان IP وطراز المتصفح ونظام التشغيل
                <br>',
        'line2' => ' <strong> 2- كيف نستخدم معلوماتك </strong><br>
            2.1. توفير وتحسين الخدمات: نستخدم المعلومات التي نجمعها لتوفير الخدمات وصيانتها وتحسينها، وكذلك لتطوير ميزات ووظائف جديدة.
            <br>
            2.2. التخصيص: قد نستخدم معلوماتك لتخصيص تجربتك على المنصة، مثل توصية مقررات أو محتوى بناءً على اهتماماتك ونشاطك.
            <br>
            2.3. الاتصال: قد نستخدم معلوماتك للتواصل معك بشأن الخدمات، مثل إرسال تحديثات أو إشعارات أو الرد على استفساراتك.
            <br>
            2.4. التحليلات والأبحاث: قد نستخدم معلوماتك لأغراض التحليل والبحث وأغراض أعمال أخرى لفهم كيفية تفاعل المستخدمين مع الخدمات وتحسين عروضنا',
        'line3' => '<strong> 3- كيف نشارك معلوماتك</strong><br>
            3.1. مزودي الخدمات: قد نشارك معلوماتك مع مزودي خدمات جهات خارجية الذين يساعدوننا في تشغيل الخدمات، مثل مزودي الاستضافة وجهات معالجة الدفع ومزودي التحليلات.
            <br>
            3.2. الامتثال القانوني: قد نشارك معلوماتك إذا اعتقدنا أنه من الضروري الامتثال للقوانين والأنظمة والعمليات القانونية أو طلبات الحكومة.
            <br>
            3.3. المعاملات التجارية: قد نشارك معلوماتك فيما يتعلق بمعاملات شركية، مثل الاندماج أو الاستحواذ أو بيع الأصول.',
        'line4' => ' <strong>
                   4- أمن البيانات
                  </strong><br>
                4.1. نطبق تدابير أمنية معقولة لحماية سرية ونزاهة المعلومات الشخصية الخاصة بك. ومع ذلك، لا يوجد طريقة إرسال عبر الإنترنت أو طريقة لتخزين إلكتروني بنسبة 100% آمنة، ولا يمكننا ضمان الأمان المطلق لمعلوماتك',
        'line5' => '
            <strong>
            5- خياراتك
            </strong><br>
            5.1. الوصول إلى معلوماتك أو تحديثها أو حذفها: قد تتمكن من الوصول إلى بعض المعلومات الشخصية الخاصة بك في إعدادات حسابك أو الاتصال بنا لتحديثها أو حذفها.
            <br>
            5.2. الاعتراض على الاتصالات: يمكنك الاعتراض على تلقي الاتصالات الترويجية منا عن طريق اتباع التعليمات المقدمة في تلك الاتصالات أو الاتصال بنا',
        'line6' => '<strong>
            6- التغييرات على سياسة الخصوصية هذه
            </strong><br>
            6.1. قد نقوم بتحديث سياسة الخصوصية هذه من وقت لآخر. سنقوم بإخطارك بأي تغييرات من خلال نشر السياسة المحدثة على الخدمات وتحديث "تاريخ السريان" في أعلى هذه السياسة.

        ',
        'line7' => '<strong>
            7- اتصل بنا
            </strong><br>
            7.1. إذا كان لديك أي أسئلة أو مخاوف بشأن سياسة الخصوصية هذه أو ممارسات الخصوصية الخاصة بنا، فيرجى الاتصال بنا.


        ',
    ],
    'terms' => [
        'intro' => '
        مرحبًا بك في ' . config('app.name') . '، منصة التعلم عبر الإنترنت التي يعمل عليها [' . config('app.name') . '] ("نحن" أو "لنا"). من خلال الوصول إلى أو استخدام منصتنا وخدماتنا (والتي يشار إليها مجتمعة باسم "الخدمات")، فإنك توافق على الالتزام بهذه الشروط والأحكام ("الشروط"). يرجى قراءة هذه الشروط بعناية قبل استخدام الخدمات.',
        'line1' => '
        <strong>
        1- قبول الشروط
        </strong><br>
        1.1. من خلال الوصول إلى أو استخدام منصتنا وخدماتنا (ويشار إليها مجتمعة بـ "الخدمات")، فإنك توافق على الالتزام بهذه الشروط والأحكام ("الشروط"). يُرجى قراءة هذه الشروط بعناية قبل استخدام الخدمات.
        <br>
        1.2. إذا لم توافق على هذه الشروط، فليس لك تفويض بالوصول إلى أو استخدام الخدمات.',
        'line2' => '<strong>
            2- الحسابات والتسجيل
            </strong><br>
            2.1. للوصول إلى بعض ميزات الخدمات واستخدامها، قد يُطلب منك التسجيل في حساب.
            <br>
            2.2. أنت مسؤول عن الحفاظ على سرية بيانات اعتماد حسابك وعن أي نشاط يحدث باستخدام حسابك.
            <br>
            2.3. أنت تقر وتضمن أن المعلومات التي تقدمها أثناء التسجيل صحيحة وكاملة.',
        'line3' => '<strong>
            3- استخدام الخدمات
            </strong><br>
            3.1. الخدمات متاحة لاستخدامك الشخصي غير التجاري فقط.
            <br>
            3.2. توافق على استخدام الخدمات وفقًا لجميع القوانين والقواعد واللوائح المعمول بها.
            <br>
            3.3. توافق على عدم الانخراط في أي استخدام غير قانوني أو غير مصرح به للخدمات، بما في ذلك على سبيل المثال لا الحصر إعاقة التشغيل الطبيعي للمنصة أو انتهاك حقوق الآخرين.',
        'line4' => '<strong>
            4- الملكية الفكرية
            </strong><br>
            4.1. الخدمات، بما في ذلك جميع المحتوى والميزات والوظائف، مملوكة لـ ' . config('app.name') . ' وترخيصها، ويتم حمايتها بموجب قوانين حقوق النشر والعلامات التجارية وغيرها من قوانين الملكية الفكرية.
            <br>
            4.2. لا يجوز لك تعديل أو نسخ أو توزيع أو إرسال أو عرض أو إنتاج أعمال مشتقة من الخدمات دون موافقتنا الخطية المسبقة.        ',
        'line5' => '<strong>
            5- محتوى الدورة والشهادات
            </strong><br>
            5.1. محتوى الدورة والمواد المتاحة من خلال الخدمات مقدمة لأغراض تعليمية فقط.
            <br>
            5.2. أنت تدرك أن إكمال دورة أو إصدار شهادة لا يضمن أي نتيجة محددة أو فرص عمل.
            <br>
            5.3. لا نقدم أي ضمانات أو تمثيلات بشأن دقة أو موثوقية أو اكتمال محتوى الدورة أو مدى ملاءمة الخدمات لاحتياجاتك المحددة.',
        'line6' => '<strong>
            6- الرسوم والمدفوعات
            </strong><br>
            6.1. قد تخضع بعض الميزات أو الدورات ضمن الخدمات لرسوم.
            <br>
            6.2. توافق على دفع أي رسوم معمول بها في الوقت المناسب وبما يتماشى مع شروط العرض المحدد.
            <br>
            6.3. نحتفظ بالحق في تغيير رسومنا أو هيكل التسعير في أي وقت، وستكون أي تغييرات من هذا القبيل سارية المفعول مستقبليًا.',
        'line7' => '<strong>
            7- الإنهاء والتعليق
            </strong><br>
            7.1. نحتفظ بالحق في تعليق أو إنهاء وصولك إلى الخدمات في أي وقت، مع أو بدون سبب، وبدون إشعار مسبق.
            <br>
            7.2. عند الإنهاء، ستنتهي على الفور حقك في استخدام الخدمات، وقد نقوم بحذف أو تعطيل حسابك وجميع المعلومات والملفات ذات الصلة. ',
        'line8' => '<strong>
            8- إخلاء المسؤولية وتحديد المسؤولية
            </strong><br>
            8.1. يتم توفير الخدمات "كما هي" و"حسبما هي متاحة"، دون ضمانات من أي نوع، سواء كانت صريحة أو ضمنية.
            <br>
    8.2. لن نكون مسؤولين عن أي أضرار غير مباشرة أو خاصة أو عرضية أو تبعية تنشأ عن أو تتعلق باستخدامك للخدمات.        ',
        'line9' => '<strong>
            9- القانون الحاكم وتسوية النزاعات
            </strong><br>
            9.1. سيتم تفسير هذه الشروط وفقًا لقوانين [جمهورية مصر العربية] وتطبيقها عليها.
            <br>
            9.2. سيتم حل أي نزاعات ناشئة عن أو متعلقة بهذه الشروط أو الخدمات من خلال التحكيم الملزم وفقًا لقواعد [جمهورية مصر العربية].',
        'line10' => '<strong>
            10- التغييرات على الشروط
            </strong><br>
            10.1. نحتفظ بالحق في تعديل هذه الشروط في أي وقت، وستكون هذه التعديلات سارية المفعول فورًا عند نشر الشروط المحدثة على الخدمات.
            <br>
            10.2. استمرار استخدامك للخدمات بعد أي تغييرات من هذا القبيل يشكل قبولك للشروط الجديدة.',
        'line11' => '<strong>
            11- اتصل بنا
            </strong><br>
            11.1. إذا كان لديك أي أسئلة أو مخاوف بشأن الشروط والأحكام، فيرجى الاتصال بنا.',
    ],
    'faqs' => [
        'question1' => '<strong>1- ازاى اسجل؟ </strong><br>
                        اضغط  <a href="' . route('contact') . '"  class="text-primary">انضم الآن</a>  وانضم لعيلتنا اللى بتكبر.',
        'question2' => '<strong> 2- هل فى مصاريف للتسجيل؟ </strong><br>
                        لا .. التسجيل مجانى تماما وهيكون دايما مجانى',
        'question3' => '<strong>2- ازاى اتواصل معاكم؟ </strong><br>
                        اضغط  <a href="' . route('contact') . '"  class="text-primary">هنا</a>  وسيب لنا رسالتك .. نحب دايما نقراها.',
        'question4' => '<strong> 4- مش عارف اسجل ممكن تساعدونى؟</strong><br>
                    اكيد .. سيب رسالتك   <a href="' . route('contact') . '"  class="text-primary">هنا</a>
                         وحد من فريق الدعم الفنى هيتواصل معاك ويساعدك تحل مشكلتك فى أسرع وقت. ',
    ],
    'contact_query' => 'التواصل للحصول على أي استفسار',

    'in_touch' => 'ابق على تواصل',
    'in_touch_info' => 'اتصل أو أرسل بريدًا إلكترونيًا أو املأ النموذج لإرسال رسالة إلينا',
    'office'=>'المقر',
    'mobile'=>'الموبايل',
    'email'=>'البريد الالكترونى',
    'your_name'=>'اسمك',
    'subject'=>'الموضوع',
    'message'=>'الرسالة',
    'send_message'=>'إرسال رسالة',
    'language'=>'اللغة',
    'logout'=>'تسجيل الخروج',
    'profile'=>'الملف الشخصى',
    'login'=>'تسجيل الدخول',
    'register'=>'التسجيل',
    'name'=>'الاسم',
    'password'=>'كلمة السر',
    'current_password'=>'كلمة السر الحالية',
    'new_password'=>'كلمة السر الجديده',
    'password_reset'=>'إعادة تعيين كلمه المرور',
    'forgot_password'=>'نسيت كلمة المرور؟ ',
    'reset_password'=>'اضغط لإعادة تعيين كلمة المرور ',
    'password_confirmation'=>'تأكيد كلمة السر',
    'remember_me'=>'تذكر كلمة المرور',
    'already_registered'=>'لديك حساب؟ ',
    'new_account'=>'ليس لديك حساب؟ ',
    'send_password_email'=>'إرسال إيميل استعادة كلمة المرور',
    'senior_year'=>'سنة الثانوية',
    'current_stage'=>'الصف الدراسى',
    'first_secondary'=>'أولى ثانوى',
    'second_secondary'=>'ثانية ثانوى',
    'third_secondary'=>'ثالثة ثانوى ',
    'department'=>'الشعبة',
    'literary'=>'أدبى',
    'sciences'=>'علمى علوم',
    'literary_azhar'=>'أدبى أزهر',
    'sciences_azhar'=>'علمى أزهر',
    'mathematics'=>'علمى رياضة',
    'city'=>'المدينه',
    'area'=>'المنطقة',
    'school'=>'المدرسة',
    'school_type'=>'نوع المدرسة',
    'second_language'=>'اللغة الثانيه',
    'whats_app'=>'واتساب',
    'mom_whats_app'=>'واتساب الأم',
    'dad_whats_app'=>'واتساب الأب',
    'dad_job'=>'وظيفة الأب',
    'facebook_link'=>'رابط الفيسبوك',
    'identity_number'=>'الرقم القومى',
    'dashboard'=>'لوحة التحكم',
    'signup_account'=>'أنشيء حسابك',
    'fill_fields'=>'املا البيانات ثم انتقل للخطوة التاليه',
    'account'=>'الحساب',
    'account_information'=>'معلومات الحساب:',
    'personal'=>'شخصى',
    'image'=>'الصورة',
    'finish'=>'انهاء',
    'user_type'=>'ماذا عنك؟ انت:',
    'student'=>'طالب',
    'parent'=>'ولى أمر',
    'teacher'=>'المدرس',
    'hours'=>'الساعات',
    'actions'=>'الإجراءات',
    'personal_information'=>'المعلومات الشخصيه',
    'select'=>'اختر',
    'first secondary'=>'أولى ثانوى',
    'second secondary'=>'ثانية ثانوى',
    'third secondary'=>'ثالث ثانوى',
    'third secondary '. \Carbon\Carbon::parse(date('Y'))->format('Y')=>'ثالثه ثانوى '. \Carbon\Carbon::parse(date('Y'))->format('Y'),
    'third secondary '. \Carbon\Carbon::parse(date('Y'))->addYear()->format('Y')=>'ثالثه ثانوى '. \Carbon\Carbon::parse(date('Y'))->addYear()->format('Y'),
    'departments'=>[
        'literary'=>'أدبى',
        'sciences'=>'علمى',
        'literary azhar'=>'أدبى أزهر',
        'sciences azhar'=>'علمى أزهر',
        'mathematics'=>'علمى رياضه'
    ],
    'school_types'=>[
        'languages'=>'لغات',
        'arabic'=>'عربى',
        'azhar'=>'أزهر',
        'IG'=>'IG',
        'american'=>'american'
    ],
    'second_languages'=>[
        'french'=>'فرنساوى',
        'deutsch'=>'ألمانى',
        'italiano'=>'إيطالى'
    ],
    'job'=>'الوظيفه',
    'popular_stages'=>'المراحل الدراسية',
    'stages'=>'المراحل',
    'show'=>'عرض',
    'add_new_lesson'=>'انشاء درس',
    'add_new_homework'=>'انشاء واجب',
    'save'=>'حفظ',
    'add_new_unit'=>'اضافه وحده جديده',
    'data_saved_success'=>'تم  حفظ التغييرات بنجاح',
    'data_saved_fail'=>'فشل فى حفظ التغييرات',
    'units_list'=>'الوحدات',
    'lessons_list'=>'الدروس',
    'unit'=>'وحده',
    'units'=>'الوحدات',
    'stage'=>'مرحله',
    'lesson'=>'درس',
    'edit_homework'=>'تعديل الواجب',
    'homework_list'=>'الواجبات',
    'submit'=>'ارسال',
    'edit_lesson'=>'تعديل الدرس',
    'parental_monitoring'=>'مراقبة الوالدين ',

    'students' => 'الطلاب',
    'codes' => 'الأكواد',
    ];
